Repository: ryujou/Maurya-Source
Catalog: ios/App/Resources/Localizable.xcstrings
Source language: en
Languages: ja, zh_hans

# device.status.write.validation.passed
source: Scene, global LED, single-group, and seven-group writes passed read-back verification. Original values were restored.
ja: シーン、全体LED、単一グループ、7グループの書き込みと読み戻しに成功し、元の値へ復元しました。
zh_hans: 场景、全局灯光、单灯组和七灯组写入均通过回读验证，原始参数已恢复。

# device.validation.description
source: Temporarily changes lighting registers, verifies them, then restores the complete original state.
ja: ライト設定を一時変更して読み戻しを確認し、完全な元の状態へ復元します。
zh_hans: 临时修改灯光寄存器并回读验证，随后恢复完整原始状态。

# device.validation.run
source: Run reversible write test
ja: 復元可能な書き込みテストを実行
zh_hans: 运行可恢复写入测试

# device.validation.title
source: Physical validation
ja: 実機検証
zh_hans: 真机验证

# device.error.readback.mismatch
source: The device acknowledged the change, but the value read back did not match. Refresh and try again.
ja: デバイスは変更を受信しましたが、読み戻した値が一致しません。更新してもう一度お試しください。
zh_hans: 设备已确认修改，但回读值不一致。请刷新后重试。

# device.status.color.applied
source: Support color applied and verified on the device.
ja: 応援カラーをデバイスへ適用し、読み戻しを確認しました。
zh_hans: 应援色已写入设备并通过回读确认。

# device.status.diagnostics.cleared
source: Diagnostics cleared and refreshed.
ja: 診断情報を消去して更新しました。
zh_hans: 诊断数据已清除并刷新。

# device.status.global.applied
source: Global brightness and gains applied and verified.
ja: 全体の明るさとゲインを適用し、読み戻しを確認しました。
zh_hans: 全局亮度和增益已写入并通过回读确认。

# device.status.group.applied
source: Lighting group applied and verified.
ja: ライトグループを適用し、読み戻しを確認しました。
zh_hans: 灯组设置已写入并通过回读确认。

# device.status.groups.applied
source: All seven lighting groups applied and verified.
ja: 7グループすべてを適用し、読み戻しを確認しました。
zh_hans: 全部七个灯组已写入并通过回读确认。

# device.status.scene.applied
source: Scene mode and speed applied and verified.
ja: シーンモードと速度を適用し、読み戻しを確認しました。
zh_hans: 场景模式和速度已写入并通过回读确认。

# palette.franchise
source: Franchise
ja: 作品シリーズ
zh_hans: 作品企划

# resources.characters
source: Characters
ja: キャラクター
zh_hans: 角色

# resources.groups
source: Groups
ja: グループ
zh_hans: 团体

# resources.search
source: Search by group or character name
ja: グループ名・キャラクター名で検索
zh_hans: 搜索团体或角色名称

# effects.error.compile.generic
source: The effect could not be compiled. Review the highlighted source and try again.
ja: エフェクトをコンパイルできませんでした。強調表示されたソースを確認して、もう一度お試しください。
zh_hans: 无法编译灯效。请检查高亮的源码后重试。

# effects.error.execution.generic
source: Effect processing stopped before it completed. Try again.
ja: エフェクト処理は完了前に停止しました。もう一度お試しください。
zh_hans: 灯效处理未完成便已停止，请重试。

# effects.error.program.generic
source: The effect operation failed. Review the file or program and try again.
ja: エフェクト操作に失敗しました。ファイルまたはプログラムを確認して、もう一度お試しください。
zh_hans: 灯效操作失败。请检查文件或程序后重试。

# effects.error.runtime.generic
source: The effect stopped because its runtime input or operation was invalid.
ja: 実行時の入力または操作が無効なため、エフェクトを停止しました。
zh_hans: 运行时输入或操作无效，灯效已停止。

# action.cancel
source: Cancel
ja: キャンセル
zh_hans: 取消

# action.delete
source: Delete
ja: 削除
zh_hans: 删除

# action.edit
source: Edit
ja: 編集
zh_hans: 编辑

# action.retry
source: Retry
ja: 再試行
zh_hans: 重试

# action.save
source: Save
ja: 保存
zh_hans: 保存

# action.undo
source: Undo delete
ja: 削除を取り消す
zh_hans: 撤销删除

# analysis.audio.sensitivity
source: Microphone sensitivity
ja: マイク感度
zh_hans: 麦克风灵敏度

# analysis.calibration
source: Calibration
ja: キャリブレーション
zh_hans: 校准

# analysis.controls
source: Controls
ja: 操作
zh_hans: 控制

# analysis.foreground.only
source: Analysis stops when this screen closes. Background analysis is not enabled.
ja: この画面を閉じると解析を停止します。バックグラウンド解析は無効です。
zh_hans: 关闭此页面即停止分析，未启用后台分析。

# analysis.input.level
source: Audio level
ja: 音量
zh_hans: 音量

# analysis.input.light
source: Ambient light
ja: 環境光
zh_hans: 环境光

# analysis.input.motion
source: Motion intensity
ja: モーション強度
zh_hans: 运动强度

# analysis.input.roll
source: Roll angle
ja: ロール角
zh_hans: 横滚角

# analysis.microphone.denied
source: Microphone access was denied. Motion analysis remains available.
ja: マイク権限が拒否されました。モーション解析は利用できます。
zh_hans: 麦克风权限已拒绝，仍可使用运动分析。

# analysis.mode.audio
source: Audio
ja: 音声
zh_hans: 音频

# analysis.mode.motion
source: Motion
ja: モーション
zh_hans: 运动

# analysis.mode.virtual
source: Virtual
ja: 仮想入力
zh_hans: 虚拟输入

# analysis.permission.context
source: Permission context
ja: 権限の説明
zh_hans: 权限说明

# analysis.permission.message
source: Microphone or motion access is requested only after you start the matching live analysis.
ja: 対応するリアルタイム解析を開始した時だけマイクまたはモーション権限を要求します。
zh_hans: 仅在你主动启动对应实时分析后，才会请求麦克风或运动权限。

# analysis.snapshot
source: Live input snapshot
ja: ライブ入力スナップショット
zh_hans: 实时输入快照

# analysis.snapshot.empty
source: No runtime inputs are currently required.
ja: 現在必要なランタイム入力はありません。
zh_hans: 当前没有要求的运行时输入。

# analysis.snapshot.stale
source: Stale sample
ja: 古いサンプル
zh_hans: 数据已过期

# analysis.snapshot.waiting
source: Waiting
ja: 待機中
zh_hans: 等待数据

# analysis.start.audio
source: Start microphone analysis
ja: マイク解析を開始
zh_hans: 开始麦克风分析

# analysis.start.motion
source: Start motion analysis
ja: モーション解析を開始
zh_hans: 开始运动分析

# analysis.state
source: Analysis
ja: 解析
zh_hans: 分析

# analysis.state.idle
source: Idle
ja: 待機中
zh_hans: 空闲

# analysis.state.running
source: Running
ja: 実行中
zh_hans: 正在运行

# analysis.state.starting
source: Starting
ja: 開始中
zh_hans: 正在启动

# analysis.status
source: Status
ja: 状態
zh_hans: 状态

# analysis.stop
source: Stop analysis
ja: 解析を停止
zh_hans: 停止分析

# analysis.virtual.enabled
source: Virtual input mode
ja: 仮想入力モード
zh_hans: 虚拟输入模式

# analysis.virtual.inputs
source: Virtual inputs
ja: 仮想入力
zh_hans: 虚拟输入

# analysis.zero.attitude
source: Zero attitude
ja: 姿勢をゼロ補正
zh_hans: 姿态归零

# app.features
source: Features
ja: 機能
zh_hans: 功能

# app.subtitle
source: Lighting control for supported Maurya devices
ja: 対応 Maurya デバイスのライトコントロール
zh_hans: 支持 Maurya 设备的灯光控制

# device.address.save.format
source: Address %1$@ · Save state %2$@
ja: アドレス %1$@ · 保存状態 %2$@
zh_hans: 地址 %1$@ · 保存状态 %2$@

# device.advanced.groups.close
source: Hide individual group controls
ja: グループ別コントロールを閉じる
zh_hans: 收起单组控制

# device.advanced.groups.open
source: Show individual group controls
ja: グループ別コントロールを開く
zh_hans: 展开单组控制

# device.detail.subtitle
source: Maurya device control
ja: Maurya デバイスコントロール
zh_hans: Maurya 设备控制

# device.global.lighting.title
source: Global lighting
ja: 全体ライト
zh_hans: 全局灯光

# device.information.title
source: Device information
ja: デバイス情報
zh_hans: 设备信息

# device.scene.title
source: Scene mode
ja: シーンモード
zh_hans: 场景模式

# navigation.back
source: Back
ja: 戻る
zh_hans: 返回

source: Device address
ja: デバイスアドレス
zh_hans: 设备地址

# device.apply
source: Apply group
ja: グループを適用
zh_hans: 应用灯组

# device.apply.all
source: Apply to all groups
ja: 全グループに適用
zh_hans: 应用到全部灯组

# device.blue.gain
source: Blue gain
ja: 青ゲイン
zh_hans: 蓝色增益

# device.brightness
source: Global brightness
ja: 全体の明るさ
zh_hans: 全局亮度

# device.color.preview
source: Current group color
ja: 現在のグループ色
zh_hans: 当前灯组颜色

# device.diagnostics
source: Diagnostics
ja: 診断
zh_hans: 诊断

# device.diagnostics.clear
source: Clear diagnostic counters
ja: 診断カウンタを消去
zh_hans: 清除诊断计数

# device.diagnostics.clear.confirm
source: Clear counters
ja: カウンタを消去
zh_hans: 清除计数

# device.diagnostics.clear.confirm.message
source: This clears the device parse-error counter. The current values cannot be restored.
ja: デバイスの解析エラーカウンタを消去します。現在値は復元できません。
zh_hans: 这将清除设备解析错误计数，当前数值无法恢复。

# device.diagnostics.clear.confirm.title
source: Clear counters?
ja: カウンタを消去しますか？
zh_hans: 清除计数？

# device.disconnect
source: Disconnect
ja: 接続解除
zh_hans: 断开连接

# device.errors
source: Parse errors
ja: 解析エラー
zh_hans: 解析错误

# device.firmware
source: Firmware
ja: ファームウェア
zh_hans: 固件

# device.global
source: Device
ja: デバイス
zh_hans: 设备

# device.global.apply
source: Apply global LEDs
ja: グローバル LED を適用
zh_hans: 应用全局 LED

# device.green.gain
source: Green gain
ja: 緑ゲイン
zh_hans: 绿色增益

# device.group.accessibility
source: Lighting group
ja: ライトグループ
zh_hans: 灯组

# device.group.format
source: Group %d
ja: グループ %d
zh_hans: 第 %d 组

# device.groups
source: Seven lighting groups
ja: 7つのライトグループ
zh_hans: 七组灯光

# device.groups.all
source: All seven groups
ja: 7グループすべて
zh_hans: 全部七组

# device.help.ota
source: Firmware Update
ja: ファームウェア更新
zh_hans: 固件更新

# device.help.ota.message
source: Check update security and device readiness.
ja: 更新のセキュリティ条件とデバイスの準備状態を確認します。
zh_hans: 检查更新安全条件和设备就绪状态。

# device.hue
source: Hue
ja: 色相
zh_hans: 色相

source: Device identifier
ja: デバイス識別子
zh_hans: 设备标识符

# device.mode
source: Mode
ja: モード
zh_hans: 模式

# device.mode.1
source: Steady
ja: 点灯
zh_hans: 常亮

# device.mode.2
source: Breathing
ja: ブリージング
zh_hans: 呼吸

# device.mode.3
source: Strobe
ja: ストロボ
zh_hans: 频闪

# device.mode.4
source: Gradient
ja: グラデーション
zh_hans: 渐变

# device.parameter
source: Strobe speed
ja: ストロボ速度
zh_hans: 频闪速度

# device.pending.characters
source: Character palettes and custom colors will be connected in a later phase.
ja: キャラクターパレットとカスタム色は後続フェーズで接続します。
zh_hans: 角色调色板和自定义颜色将在后续阶段接入。

# device.pending.console
source: Control, telemetry, and diagnostics will be connected in later phases.
ja: 操作、テレメトリ、診断は後続フェーズで接続します。
zh_hans: 控制、遥测和诊断将在后续阶段接入。

# device.pending.effects
source: The effect library and editor will be connected in later phases.
ja: エフェクトライブラリとエディタは後続フェーズで接続します。
zh_hans: 效果库和编辑器将在后续阶段接入。

# device.pending.help
source: Help content and OTA will be connected in later phases.
ja: ヘルプと OTA は後続フェーズで接続します。
zh_hans: 帮助内容和 OTA 将在后续阶段接入。

# device.receive.count
source: Received frames
ja: 受信フレーム
zh_hans: 接收帧数

# device.receive.overflow
source: Receive overflows
ja: 受信オーバーフロー
zh_hans: 接收溢出

# device.reconnect
source: Reconnect
ja: 再接続
zh_hans: 重新连接

# device.reconnect.unavailable
source: Select a device before reconnecting.
ja: 再接続するデバイスを先に選択してください。
zh_hans: 请先选择设备再重新连接。

# device.red.gain
source: Red gain
ja: 赤ゲイン
zh_hans: 红色增益

# device.refresh
source: Refresh
ja: 更新
zh_hans: 刷新

# device.saturation
source: Saturation
ja: 彩度
zh_hans: 饱和度

# device.save.state
source: Save state
ja: 保存状態
zh_hans: 保存状态

# device.scene.apply
source: Apply scene
ja: シーンを適用
zh_hans: 应用场景

# device.scene.mode
source: Scene mode
ja: シーンモード
zh_hans: 场景模式

# device.scene.mode.1
source: Static
ja: 静的
zh_hans: 静态

# device.scene.mode.2
source: Flow left
ja: 左へ流す
zh_hans: 向左流动

# device.scene.mode.3
source: Flow right
ja: 右へ流す
zh_hans: 向右流动

# device.scene.mode.4
source: Ping-pong flow
ja: 往復フロー
zh_hans: 往返流动

# device.scene.parameter
source: Scene speed
ja: シーン速度
zh_hans: 场景速度

# device.section.characters
source: Colors
ja: 応援色
zh_hans: 应援色

# device.section.console
source: Console
ja: コンソール
zh_hans: 控制台

# device.section.effects
source: Effects
ja: エフェクト
zh_hans: 效果

# device.section.help
source: Help
ja: ヘルプ
zh_hans: 帮助

# device.section.picker
source: Device section
ja: デバイスのセクション
zh_hans: 设备区域

# device.strobe.period.format
source: Estimated period: %d ms
ja: 推定周期：%d ms
zh_hans: 预计周期：%d 毫秒

# device.temperature
source: Temperature
ja: 温度
zh_hans: 温度

# device.title
source: Device
ja: デバイス
zh_hans: 设备

# device.transmit.drop
source: Transmit drops
ja: 送信ドロップ
zh_hans: 发送丢弃

# device.value
source: Brightness
ja: 明るさ
zh_hans: 亮度

# device.variant
source: Variant
ja: バリアント
zh_hans: 型号

# device.vdda
source: Supply voltage
ja: 供給電圧
zh_hans: 供电电压

# editor.format
source: Format
ja: 整形
zh_hans: 格式化

# editor.no.selection.message
source: Choose or create an effect in the effect library first.
ja: 先にエフェクトライブラリで選択または作成してください。
zh_hans: 请先在灯效库中选择或新建灯效。

# editor.no.selection.title
source: No effect selected
ja: エフェクトが選択されていません
zh_hans: 未选择灯效

# editor.phase.failed
source: Editor failed
ja: エディタ失敗
zh_hans: 编辑器失败

# editor.phase.idle
source: Idle
ja: 待機中
zh_hans: 空闲

# editor.phase.loading
source: Loading verified bundle
ja: 検証済みバンドルを読込中
zh_hans: 正在载入已校验资源包

# editor.phase.ready
source: Ready
ja: 準備完了
zh_hans: 就绪

# editor.phase.terminated
source: Web content terminated; restoring autosave
ja: Web コンテンツ終了。自動保存を復元中
zh_hans: 网页内容已终止，正在恢复自动保存

# editor.playback.state
source: Playback
ja: 再生状態
zh_hans: 播放状态

# editor.preview
source: Preview
ja: プレビュー
zh_hans: 预览

# editor.preview.hsv %lld %lld %lld
source: Hue %1$lld, saturation %2$lld, brightness %3$lld
ja: 色相 %1$lld、彩度 %2$lld、明るさ %3$lld
zh_hans: 色相 %1$lld，饱和度 %2$lld，亮度 %3$lld

# editor.redo
source: Redo
ja: やり直す
zh_hans: 重做

# editor.run
source: Run
ja: 実行
zh_hans: 运行

# editor.save
source: Save
ja: 保存
zh_hans: 保存

source: Editor tools
ja: 編集ツール
zh_hans: 编辑工具

# editor.undo
source: Undo
ja: 元に戻す
zh_hans: 撤销

# effects.actions
source: Effect actions
ja: エフェクト操作
zh_hans: 灯效操作

# effects.add
source: Add effect
ja: エフェクトを追加
zh_hans: 添加灯效

# effects.add.blocks
source: New Blockly effect
ja: Blockly エフェクトを作成
zh_hans: 新建 Blockly 灯效

# effects.add.script
source: New Maurya Script effect
ja: Maurya Script エフェクトを作成
zh_hans: 新建 Maurya Script 灯效

# effects.copy
source: Duplicate
ja: 複製
zh_hans: 创建副本

# effects.copy.script
source: Copy as code
ja: コードとして複製
zh_hans: 复制为代码

# effects.delete
source: Delete
ja: 削除
zh_hans: 删除

# effects.delete.confirm.message
source: This removes the local program and cannot be undone.
ja: ローカルのプログラムが削除され、元に戻せません。
zh_hans: 这会删除本地程序，且无法撤销。

# effects.delete.confirm.title
source: Delete this effect?
ja: このエフェクトを削除しますか？
zh_hans: 删除这个效果？

# effects.empty.message
source: Create a Blockly or Maurya Script effect to begin.
ja: Blockly または Maurya Script エフェクトを作成してください。
zh_hans: 新建 Blockly 或 Maurya Script 灯效后开始编辑。

# effects.empty.title
source: No effects
ja: エフェクトがありません
zh_hans: 暂无灯效

# effects.export
source: Export
ja: 書き出す
zh_hans: 导出

# effects.export.all
source: Export all
ja: すべて書き出す
zh_hans: 导出全部

# effects.file.error.title
source: Effect file error
ja: エフェクトファイルエラー
zh_hans: 灯效文件错误

# effects.gate
source: Compatibility gate
ja: 互換性 Gate
zh_hans: 兼容性 Gate

# effects.gate.message
source: The remaining compiler catalog and Android golden fixtures are not yet complete; this screen does not claim Phase 6 parity.
ja: 残りのコンパイラ項目と Android golden fixture は未完了です。Phase 6 完全互換は表明しません。
zh_hans: 其余编译器目录和 Android golden fixture 尚未完成；此页面不宣称 Phase 6 已对齐。

# effects.import
source: Import
ja: 読み込む
zh_hans: 导入

# effects.import.conflict.message
source: Choose how programs with existing identifiers should be handled.
ja: 同じ識別子のエフェクトをどう扱うか選択してください。
zh_hans: 请选择如何处理标识符已存在的灯效。

# effects.import.conflict.title
source: Resolve import conflicts
ja: 読み込み競合を解決
zh_hans: 处理导入冲突

# effects.import.conflicts
source: Conflicts
ja: 競合
zh_hans: 冲突

# effects.import.copy
source: Import as copies
ja: コピーとして読み込む
zh_hans: 作为副本导入

# effects.import.error.details
source: Items that cannot be imported
ja: インポートできない項目
zh_hans: 无法导入的项目

# effects.import.errors
source: Errors
ja: エラー
zh_hans: 错误

# effects.import.overwrite
source: Overwrite existing
ja: 既存を上書き
zh_hans: 覆盖现有灯效

# effects.import.programs
source: Programs
ja: プログラム
zh_hans: 程序

# effects.import.skip
source: Skip existing
ja: 既存をスキップ
zh_hans: 跳过现有灯效

# effects.import.strategy
source: Conflict Strategy
ja: 競合の処理
zh_hans: 冲突处理

# effects.import.summary
source: Import Summary
ja: インポート概要
zh_hans: 导入摘要

# effects.import.valid
source: Valid programs
ja: 有効なプログラム
zh_hans: 有效程序

# effects.kind.blocks
source: Blocks
ja: ブロック
zh_hans: 积木

# effects.kind.script
source: Code
ja: コード
zh_hans: 代码

# effects.library
source: Runtime & editor
ja: ランタイムとエディタ
zh_hans: 运行时与编辑器

# effects.name.ja
source: Japanese name
ja: 日本語名
zh_hans: 日文名称

# effects.name.message
source: Enter at least one name. The other language uses the same name when left blank.
ja: 少なくとも1つ入力してください。空欄の言語には同じ名前を使用します。
zh_hans: 至少填写一个名称；另一项为空时会使用相同名称。

# effects.name.title
source: Effect name
ja: エフェクト名
zh_hans: 效果名称

# effects.name.zh
source: Chinese name
ja: 中国語名
zh_hans: 中文名称

# effects.open.hint
source: Opens this effect in the verified offline editor.
ja: 検証済みのオフラインエディタで開きます。
zh_hans: 在已校验的离线编辑器中打开此灯效。

# effects.rename
source: Rename
ja: 名前を変更
zh_hans: 重命名

# effects.runtime.builtins
source: Built-in functions
ja: 組み込み関数
zh_hans: 内置函数

# effects.runtime.inputs
source: Runtime inputs
ja: ランタイム入力
zh_hans: 运行时输入

# effects.sample.editor
source: Open Blockly editor
ja: Blockly エディタを開く
zh_hans: 打开 Blockly 编辑器

# effects.selected
source: Selected
ja: 選択中
zh_hans: 已选择

# feature.analysis
source: Live Analysis
ja: リアルタイム解析
zh_hans: 实时分析

# feature.editor
source: Effect Editor
ja: エフェクトエディタ
zh_hans: 效果编辑器

# feature.effects
source: Effect Library
ja: エフェクトライブラリ
zh_hans: 效果库

# feature.ota
source: Firmware Update
ja: ファームウェア更新
zh_hans: 固件更新

# feature.playback
source: Effect Playback
ja: エフェクト再生
zh_hans: 效果播放

# feature.resources
source: Resources & Palettes
ja: リソースとパレット
zh_hans: 资源与调色板

# help.algorithms.body
source: Math, waveforms, interpolation, easing, smoothing, hysteresis, edges, peak hold, deterministic random, noise, and 7-group patterns are available. Typed lists hold up to 32 items. Up to 16 non-recursive functions are allowed with a maximum call depth of 8.
ja: 数学、波形、補間、イージング、平滑化、ヒステリシス、エッジ、ピーク保持、再現可能な乱数、ノイズ、7グループのパターンを利用できます。型付きリストは最大32項目、非再帰関数は最大16個、呼び出し深度は8です。
zh_hans: 支持数学、波形、插值、缓动、平滑、迟滞、边沿、峰值保持、可复现随机数、噪声及 7 组图案。类型列表最多 32 项；最多 16 个非递归函数，最大调用深度为 8。

# help.algorithms.title
source: Algorithms, Lists, and Functions
ja: アルゴリズム・リスト・関数
zh_hans: 算法、列表与函数

# help.blocks.body
source: Connect executable blocks below the single Start block. Light, time, variables, arithmetic, conditions, control, algorithms, lists, functions, sensors, audio, and patterns are supported. Every infinite loop and visible color change must advance time. Preview and hardware use the same interpreter; playback changes RAM only and restores the prior effect on stop or disconnect.
ja: 実行ブロックは唯一の開始ブロックの下へ接続します。ライト、時間、変数、演算、判定、制御、アルゴリズム、リスト、関数、センサー、音声、パターンに対応します。無限ループと色変更は必ず時間を進めます。プレビューと実機は同じインタープリターを使い、RAM のみを変更して停止・切断時に元へ戻します。
zh_hans: 可执行积木需连接在唯一的开始积木下。支持灯光、时间、变量、运算、判断、控制、算法、列表、函数、传感器、音频和图案。无限循环和颜色变化必须推进时间。预览与真机使用同一解释器；播放只修改 RAM，停止或断线后恢复原灯效。

# help.blocks.title
source: Block Effect Programming
ja: ブロック式エフェクトプログラミング
zh_hans: 积木效果编程

# help.buttons.body
source: Tap GPIO9 to change scene; hold and release it to switch BLE/Wi‑Fi. GPIO4 OFF turns the lights off and enters deep sleep. The status LED is off before BLE connects, solid when connected, slow-blinking on Wi‑Fi, and fast-blinking while switching.
ja: GPIO9 の短押しでシーン、長押し後に離すと BLE/Wi‑Fi が切り替わります。GPIO4 が OFF の場合は消灯して深くスリープします。LED は BLE 未接続時に消灯、接続時に点灯、Wi‑Fi でゆっくり点滅、切替時に速く点滅します。
zh_hans: GPIO9 短按切换场景，长按并松开切换 BLE/Wi‑Fi。GPIO4 为 OFF 时熄灯并深睡眠。BLE 未连接时状态灯熄灭，连接后常亮；Wi‑Fi 慢闪，切换时快闪。

# help.buttons.title
source: Buttons, Switch, and Status LED
ja: ボタン・スイッチ・表示LED
zh_hans: 按键、开关和状态灯

# help.connect.bluetooth
source: Enable Bluetooth and allow Maurya device access
ja: Bluetooth を有効にし Maurya デバイスアクセスを許可
zh_hans: 开启蓝牙并允许 Maurya 访问设备

# help.connect.nearby
source: Power on one nearby Maurya light
ja: 近くの Maurya ライトを1台起動
zh_hans: 开启附近的一台 Maurya 灯具

# help.connect.retry
source: Return to the scan screen and refresh if it does not appear
ja: 表示されない場合はスキャン画面へ戻って更新
zh_hans: 若未出现，请返回扫描页并刷新

# help.connect.title
source: Connect
ja: 接続
zh_hans: 连接

# help.controls.global
source: Global LEDs adjust brightness and RGB calibration
ja: グローバル LED で明るさと RGB 補正を調整
zh_hans: 全局 LED 用于调整亮度与 RGB 校准

# help.controls.group
source: Group controls write one of seven lighting groups
ja: 7つのライトグループから1つを書き換え
zh_hans: 灯组控制会写入七个灯组中的一个

# help.controls.palette
source: Support colors are previewed first and sent only after Apply
ja: 応援カラーは先にプレビューし、適用後のみ送信
zh_hans: 应援色先预览，仅在点击应用后发送

# help.controls.scene
source: Scene changes animation mode and speed
ja: シーンでアニメーションモードと速度を変更
zh_hans: 场景用于调整动画模式和速度

# help.controls.title
source: Controls
ja: 操作
zh_hans: 控制说明

# help.intro
source: Connection, control, programming, and recovery guidance is available here offline.
ja: 接続、操作、プログラミング、復旧方法をオフラインで確認できます。
zh_hans: 连接方法、控制流程、编程和故障恢复均可在此离线查看。

# help.lighting.body
source: Device information shows temperature, voltage, address, and diagnostics. Scene controls motion and speed; global controls brightness and RGB gain. Apply steady/strobe, HSV, and speed to all groups or edit seven groups individually. Wait for the saved state before removing power.
ja: 温度、電圧、アドレス、診断を確認できます。シーンでは動きと速度、全体照明では明るさと RGB ゲインを調整します。常時点灯/点滅、HSV、速度を全体または7グループ個別に設定できます。電源を切る前に保存済みを確認してください。
zh_hans: 设备信息显示温度、电压、地址和诊断。场景控制运动与速度，全局控制亮度和 RGB 增益。可统一设置常亮/频闪、HSV 和速度，也可单独调整 7 组。断电前请等待已保存状态。

# help.lighting.title
source: Lighting Controls
ja: ライトコントロール
zh_hans: 灯光控制

# help.network.body
source: A “No Internet” warning on the device Wi‑Fi is expected; remain connected and open http://192.168.4.1/. If no IP is assigned, forget the network and restart. A manual address can use 192.168.4.2/24 with gateway and DNS 192.168.4.1. At most two clients can connect.
ja: デバイス Wi‑Fi の「インターネット接続なし」は正常です。接続を維持して http://192.168.4.1/ を開きます。IP がない場合はネットワークを削除して再起動し、手動なら 192.168.4.2/24、ゲートウェイ/DNS は 192.168.4.1 を使います。同時接続は2台までです。
zh_hans: 设备 Wi‑Fi 显示“无互联网”属于正常现象，请保持连接并访问 http://192.168.4.1/。无法获取 IP 时忘记网络并重启；手动地址可设为 192.168.4.2/24，网关和 DNS 为 192.168.4.1。最多同时连接 2 台。

# help.network.title
source: Connection and Troubleshooting
ja: 接続とトラブルシューティング
zh_hans: 连接与故障排查

# help.offline.body
source: Help, controls, app resources, and the character catalog do not depend on a CDN, online fonts, or an external server.
ja: 説明、操作、アプリ資源、キャラクターカタログは CDN、オンラインフォント、外部サーバーを使用しません。
zh_hans: 说明、控制、APP 资源和角色色板不依赖 CDN、在线字体或外部服务器。

# help.offline.title
source: Fully Offline
ja: 完全オフライン対応
zh_hans: 完全离线

# help.palette.body
source: Search members by Chinese or Japanese name and select their HEX support color. Applying to all seven groups converts it to HSV while preserving each group’s mode and speed.
ja: 中国語名または日本語名で検索し、HEX 応援色を選べます。全7グループへ適用すると HSV に変換し、各グループのモードと速度を保持します。
zh_hans: 可用中文或日文名称搜索成员并选择 HEX 应援色。应用到全部 7 组时会转换为 HSV，同时保留各组模式和速度。

# help.palette.title
source: Character Support Colors
ja: キャラクター応援カラー
zh_hans: 角色应援色

# help.quick.body
source: The device starts in BLE mode and can be controlled by Maurya or USB Serial. Hold GPIO9 for about 2 seconds and release to save and switch to Wi‑Fi. Join Maurya-XXXX with password Maurya123, then open 192.168.4.1 if the portal does not appear.
ja: 初回は BLE モードで、Maurya または USB Serial から操作できます。GPIO9 を約2秒長押しして離すと保存して Wi‑Fi へ切り替わります。Maurya-XXXX にパスワード Maurya123 で接続し、表示されない場合は 192.168.4.1 を開きます。
zh_hans: 设备首次启动默认为 BLE 模式，可使用 Maurya 或 USB Serial 操作。长按 GPIO9 约 2 秒并松开可保存并切换至 Wi‑Fi。连接 Maurya-XXXX，密码 Maurya123；未自动弹页时访问 192.168.4.1。

# help.quick.title
source: First Use
ja: 初回起動
zh_hans: 首次使用

# help.recovery.body
source: USB Serial Modbus remains available in BLE and Wi‑Fi modes for diagnostics and recovery. Delayed saving and dual slots protect configuration. A production-tool full erase restores default BLE and lighting settings.
ja: USB Serial Modbus は BLE/Wi‑Fi の両方で診断と復旧に使えます。設定は遅延保存と二重スロットで保護され、量産ツールの全消去で初期 BLE とデフォルト灯光へ戻ります。
zh_hans: USB Serial Modbus 在 BLE 和 Wi‑Fi 模式下均可用于诊断和恢复。配置采用延迟保存和双槽保护；量产工具全片擦除后会恢复默认 BLE 与默认灯效。

# help.recovery.title
source: Recovery, Saving, and Versions
ja: 復旧・保存・バージョン
zh_hans: 恢复、保存与版本

# help.safety.foreground
source: Device control is foreground-only and stops on disconnect.
ja: デバイス制御はフォアグラウンド専用で、切断時に停止します。
zh_hans: 设备控制仅在前台运行，断线后停止。

# help.safety.title
source: Status and privacy
ja: 状態とプライバシー
zh_hans: 状态与隐私

# help.safety.truthful
source: Unavailable hardware and services remain disabled; the app never substitutes demo success.
ja: 利用できないハードウェアとサービスは無効のままにし、デモ成功で代替しません。
zh_hans: 不可用的硬件和服务保持禁用，应用不会用演示成功替代。
